Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 299, 299, 3)  0                                            
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 148, 148, 60) 4560        input_2[0][0]                    
__________________________________________________________________________________________________
spatial_dropout2d_2 (SpatialDro (None, 148, 148, 60) 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 148, 148, 60) 240         spatial_dropout2d_2[0][0]        
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 49, 49, 60)   0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 24, 24, 50)   27050       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
spatial_dropout2d_3 (SpatialDro (None, 24, 24, 50)   0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 24, 24, 50)   200         spatial_dropout2d_3[0][0]        
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 12, 12, 50)   0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 50)           0           max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 50)           0           global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 50)           2550        dropout_4[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 50)           0           dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, 30)           1530        dropout_5[0][0]                  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 30)           0           dense_5[0][0]                    
__________________________________________________________________________________________________
dense_6 (Dense)                 (None, 1)            31          dropout_6[0][0]                  
__________________________________________________________________________________________________
any_predictions (Activation)    (None, 1)            0           dense_6[0][0]                    
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 31)           0           any_predictions[0][0]            
                                                                 dropout_6[0][0]                  
__________________________________________________________________________________________________
subtype_pred (Dense)            (None, 5)            160         concatenate_2[0][0]              
==================================================================================================
Total params: 36,321
Trainable params: 36,101
Non-trainable params: 220
__________________________________________________________________________________________________
