Model: "model_9"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_9 (InputLayer)            (None, 299, 299, 3)  0                                            
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 148, 148, 60) 4560        input_9[0][0]                    
__________________________________________________________________________________________________
spatial_dropout2d_16 (SpatialDr (None, 148, 148, 60) 0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 148, 148, 60) 240         spatial_dropout2d_16[0][0]       
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 49, 49, 60)   0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 24, 24, 100)  54100       max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
spatial_dropout2d_17 (SpatialDr (None, 24, 24, 100)  0           conv2d_17[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 24, 24, 100)  400         spatial_dropout2d_17[0][0]       
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 12, 12, 100)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 6, 6, 50)     20050       max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
spatial_dropout2d_18 (SpatialDr (None, 6, 6, 50)     0           conv2d_18[0][0]                  
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 6, 6, 50)     200         spatial_dropout2d_18[0][0]       
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 3, 3, 50)     0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_9 (Glo (None, 50)           0           max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
dropout_25 (Dropout)            (None, 50)           0           global_average_pooling2d_9[0][0] 
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 50)           2550        dropout_25[0][0]                 
__________________________________________________________________________________________________
dropout_26 (Dropout)            (None, 50)           0           dense_25[0][0]                   
__________________________________________________________________________________________________
dense_26 (Dense)                (None, 30)           1530        dropout_26[0][0]                 
__________________________________________________________________________________________________
dropout_27 (Dropout)            (None, 30)           0           dense_26[0][0]                   
__________________________________________________________________________________________________
dense_27 (Dense)                (None, 1)            31          dropout_27[0][0]                 
__________________________________________________________________________________________________
any_predictions (Activation)    (None, 1)            0           dense_27[0][0]                   
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 31)           0           any_predictions[0][0]            
                                                                 dropout_27[0][0]                 
__________________________________________________________________________________________________
subtype_pred (Dense)            (None, 5)            160         concatenate_9[0][0]              
==================================================================================================
Total params: 83,821
Trainable params: 83,401
Non-trainable params: 420
__________________________________________________________________________________________________
